#### Tofu Plan Output - observability_stack_ctrl_plane_infra
```

[1m[36mNote:[0m[1m Objects have changed outside of OpenTofu
[0m
OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

[1m  # module.gke.google_container_cluster.primary[0m has changed
[0m  [33m~[0m[0m resource "google_container_cluster" "primary" {
        id                                       = "projects/ctrl-plane-prod-b1b92df2/locations/us-central1/clusters/observability-stack-uvm2"
      [33m~[0m[0m master_version                           = "1.31.5-gke.1169000" [33m->[0m[0m "1.31.6-gke.1020000"
        name                                     = "observability-stack-uvm2"
      [33m~[0m[0m node_version                             = "1.31.5-gke.1169000" [33m->[0m[0m "1.31.6-gke.1020000"
        [90m# (27 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m node_pool {
            name                        = "default-pool"
          [33m~[0m[0m version                     = "1.31.5-gke.1169000" [33m->[0m[0m "1.31.6-gke.1020000"
            [90m# (6 unchanged attributes hidden)[0m[0m

            [90m# (5 unchanged blocks hidden)[0m[0m
        }
      [33m~[0m[0m node_pool {
            name                        = "observability-resources"
          [33m~[0m[0m version                     = "1.31.5-gke.1169000" [33m->[0m[0m "1.31.6-gke.1020000"
            [90m# (6 unchanged attributes hidden)[0m[0m

            [90m# (5 unchanged blocks hidden)[0m[0m
        }
      [33m~[0m[0m node_pool {
            name                        = "public-pool"
          [33m~[0m[0m version                     = "1.31.5-gke.1169000" [33m->[0m[0m "1.31.6-gke.1020000"
            [90m# (6 unchanged attributes hidden)[0m[0m

            [90m# (5 unchanged blocks hidden)[0m[0m
        }

        [90m# (22 unchanged blocks hidden)[0m[0m
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

OpenTofu will perform the following actions:

[1m  # google_artifact_registry_repository.backend[0m will be created
[0m  [32m+[0m[0m resource "google_artifact_registry_repository" "backend" {
      [32m+[0m[0m create_time      = (known after apply)
      [32m+[0m[0m effective_labels = (known after apply)
      [32m+[0m[0m format           = "DOCKER"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m location         = "us-central1"
      [32m+[0m[0m mode             = "STANDARD_REPOSITORY"
      [32m+[0m[0m name             = (known after apply)
      [32m+[0m[0m project          = "ctrl-plane-prod-b1b92df2"
      [32m+[0m[0m repository_id    = "backend"
      [32m+[0m[0m terraform_labels = (known after apply)
      [32m+[0m[0m update_time      = (known after apply)
    }

[1m  # google_artifact_registry_repository.frontend[0m will be created
[0m  [32m+[0m[0m resource "google_artifact_registry_repository" "frontend" {
      [32m+[0m[0m create_time      = (known after apply)
      [32m+[0m[0m effective_labels = (known after apply)
      [32m+[0m[0m format           = "DOCKER"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m location         = "us-central1"
      [32m+[0m[0m mode             = "STANDARD_REPOSITORY"
      [32m+[0m[0m name             = (known after apply)
      [32m+[0m[0m project          = "ctrl-plane-prod-b1b92df2"
      [32m+[0m[0m repository_id    = "frontend"
      [32m+[0m[0m terraform_labels = (known after apply)
      [32m+[0m[0m update_time      = (known after apply)
    }

[1m  # google_artifact_registry_repository.jobs[0m will be created
[0m  [32m+[0m[0m resource "google_artifact_registry_repository" "jobs" {
      [32m+[0m[0m create_time      = (known after apply)
      [32m+[0m[0m effective_labels = (known after apply)
      [32m+[0m[0m format           = "DOCKER"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m location         = "us-central1"
      [32m+[0m[0m mode             = "STANDARD_REPOSITORY"
      [32m+[0m[0m name             = (known after apply)
      [32m+[0m[0m project          = "ctrl-plane-prod-b1b92df2"
      [32m+[0m[0m repository_id    = "jobs"
      [32m+[0m[0m terraform_labels = (known after apply)
      [32m+[0m[0m update_time      = (known after apply)
    }

[1m  # google_project_iam_member.frontend[0m will be created
[0m  [32m+[0m[0m resource "google_project_iam_member" "frontend" {
      [32m+[0m[0m etag    = (known after apply)
      [32m+[0m[0m id      = (known after apply)
      [32m+[0m[0m member  = "serviceAccount:gke-obs-uvm2-nodes-sa@ctrl-plane-prod-b1b92df2.iam.gserviceaccount.com"
      [32m+[0m[0m project = "ctrl-plane-prod-b1b92df2"
      [32m+[0m[0m role    = "roles/artifactregistry.reader"
    }

[1mPlan:[0m 4 to add, 0 to change, 0 to destroy.
[0m
```
    